site-lisp/config/+Mode.org
* lexical
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src
* counsel
#+begin_src emacs-lisp
;;;###autoload
(require 'counsel)
;;(global-set-key (kbd "C-x b") 'ivy-switch-buffer)
;;(global-set-key (kbd "M-x") 'counsel-M-x)
;;(global-set-key (kbd "C-x C-f") 'counsel-find-file)
;; (global-set-key (kbd "C-s") 'counsel-line)
;;(global-set-key (kbd "SPC f r") 'counsel-recentf)
(global-set-key "\C-s" 'swiper)
#+end_src


* evil
#+begin_src emacs-lisp

;;Warning (evil-collection): Make sure to set `evil-want-keybinding' to nil before loading evil or evil-collection.
;;
;;See https://github.com/emacs-evil/evil-collection/issues/60 for more details.
;;Warning (evil-collection): Make sure to set `evil-want-keybinding' to nil before loading evil or evil-collection.
;;
;;See https://github.com/emacs-evil/evil-collection/issues/60 for more details.
(setq evil-want-integration t)
(setq evil-want-keybinding nil)

;;;###autoload
(require 'evil)
(evil-mode)
;; (setq-default evil-disable-insert-state-bindings t)
;; (defindebuge-key evil-insert-state-map (kbd "C-a") 'evil-beginning-of-line)
(define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)
(define-key evil-insert-state-map (kbd "C-e") 'doom/forward-to-last-non-comment-or-eol)

(define-key evil-insert-state-map (kbd "C-a") 'doom/backward-to-bol-or-indent)

(define-key evil-visual-state-map (kbd "v") 'evil-visual-line)
#+end_src
** undo-fu
#+begin_src emacs-lisp
;;;###autoload
(require 'undo-fu)

;;(global-undo-tree-mode)
;;(evil-set-undo-system 'undo-tree)
(setq evil-set-undo-system 'undo-fu)
#+end_src

** evil-matchit
#+begin_src emacs-lisp
;;;###autoload
(require 'evil-matchit)

(global-evil-matchit-mode 1)

(evil-define-key 'normal 'global (kbd "<tab>")  'evil-jump-item)
#+end_src

** alda
#+begin_src emacs-lisp
;;;###autoload
(require 'alda-mode)
(setq alda-binary-location "E:/alda/alda.exe")
#+end_src

** evil-collection
#+begin_src emacs-lisp

;;;###autoload
(require 'evil-collection)
(evil-collection-init)

#+end_src
* vertico
#+begin_src emacs-lisp
;;;###autoload
(require 'vertico)
(vertico-mode)

#+end_src
** 配置 esc 退出当前 minibuffer
#+begin_src emacs-lisp
(define-key vertico-map (kbd "<escape>") 'minibuffer-keyboard-quit)
#+end_src
- [[https://github.com/emacs-evil/evil/pull/861][Use evil-esc in minibuffers]]

* orderless
#+begin_src emacs-lisp
;;;###autoload
(require 'orderless)
;;(orderless-mode)
(setq completion-styles '(orderless))
#+end_src

* marginalia
#+begin_src emacs-lisp
;;;###autoload
(require 'marginalia)
(marginalia-mode)
#+end_src
* corfu
#+begin_quote
补全
#+end_quote
#+begin_src emacs-lisp
(require 'corfu)
(corfu-global-mode)

(setq corfu-auto t)

(setq tab-always-indent 'complete)
#+end_src
* all-the-icons
#+begin_src emacs-lisp

#+end_src
** corfu icon
#+begin_src emacs-lisp
(require 'kind-all-the-icons)
(add-to-list 'corfu-margin-formatters 
               #'kind-all-the-icons-margin-formatter)
#+end_src
* svg-lib
#+begin_src emacs-lisp
;;;###autoload
(require 'svg-lib)
#+end_src
** svg-tag-mode
#+begin_src emacs-lisp
;;;###autoload
(require 'svg-tag-mode)

(setq svg-tag-tags
      '((":TODO:" . ((lambda (tag) (svg-tag-make "TODO"))))))
#+end_src
* awesome-tray-mode
#+begin_src emacs-lisp
;; (global-hide-mode-line-mode 1)
;;;###autoload
(require 'awesome-tray)
(awesome-tray-mode 1)
(setq
 awesome-tray-active-modules '("mode-name" "location" "buffer-name")
 awesome-tray-mode-line-active-color "White"
 )
#+end_src
* tempel 
#+begin_src emacs-lisp
;; (global-hide-mode-line-mode 1)
;;;###autoload
(require 'tempel)
(setq tempel-path (concat config-path "templates"))

#+end_src

